Repository: advancedresearch/lojban
Catalog: assets/en-jbo.tmx
Source language: en
Languages: jbo

source: He speaks English well.
jbo: ko'a certu lo nu se glibau

source: He teaches English.
jbo: ra ctuca fo lo glibau

source: He does not smoke.
jbo: ko'a na'e sigva'u

source: He gave three wrong answers.
jbo: ra pu cire'u spusku lo naljetnu

source: He was listening to music.
jbo: ko'a pu ca'o tinju'i lo zgike

source: He is good at singing.
jbo: ka'e xamgu sanga

source: He dropped a vase.
jbo: ko'a pu frlygau lo kabri

source: He always says "Hello" when I see him.
jbo: ra cusku lu coi li'u ca lo ro nu mi penmi vo'a

source: He goes to the office by car.
jbo: ko'a klama lo briju fu lo karce

source: He is not in.
jbo: ta na nenri

source: He was made much of at school.
jbo: ko'a pu na'o se sinma bu'u lo ckule

source: He writes English with ease.
jbo: ra frili ciska bau lo glico

source: He acquired the habit of snacking.
jbo: ra co'a se tcaci lo nu binsaicti

source: He is good-looking and smart.
jbo: melbi gi'e mencre

source: He burst into laughter.
jbo: ra pu co'a mutce cmila

source: He doesn't eat raw fish.
jbo: ra na citka lo nalseljukpa finpe

source: He's strong.
jbo: tsali

source: He looks strong.
jbo: ra simlu lo ka tsali

source: He has decided to become a teacher.
jbo: ra jdice lo nu co'a ctuca

source: He was wearing a gold necklace and a coat made of bird feathers.
jbo: .i pu dasni lo solji ke cnebo karli .e lo cipni pimlu kosta

source: He said that he had a lot of money.
jbo: ra cusku lo se du'u vo'a ralte so'i lo jdini

source: He wants you to stay here.
jbo: ra djica lo nu stali ti

source: He's stronger than you.
jbo: ra tsali zmadu do

source: He ran faster than his brother did.
jbo: ra pu zmadu lo bruna be vo'a lo ka sutra lo nu bajra

source: He never lies.
jbo: ra no roi ticysku

source: He is satisfied with the result.
jbo: ra selmansa le jalge

source: He looks healthy.
jbo: ra simlu lo ka kanro

source: He told deliberate lies.
jbo: ko'a pu cusku lo tolsnuti se ticysku

source: He is happy.
jbo: ra gleki

source: I believe that he's happy.
jbo: ia ra gleki

source: Where is he running now?
jbo: se ka'a ma ra ca bajra

source: He is studying in the library now.
jbo: ra ca tadji bu'u lo ckusro

source: He is reading a book.
jbo: ca'o tcidu fi lo cukta

source: He got his shirt mended by his wife.
jbo: ra zo'u lo ri creka cu se cikre lo speni

source: He was accompanied by his wife.
jbo: ra kansa lo speni be vo'a

source: He was promoted by virtue of his abilities.
jbo: ko'a pu mo'u palbi'o ki'u lo se kakne be ko'a

source: He was out of humor as he had lost his wallet.
jbo: ko'a tolxajmi .imu'ibo ko'a pu cirko lo di'irvau

source: He writes books.
jbo: ko'a ciska lo cukta

source: He was late for school yesterday.
jbo: lo nu ra klama lo ckule ca lo prulamdei cu lerci

source: He read this book yesterday.
jbo: ra tcidu lo vi cukta ca lo prulamdei

source: He died yesterday.
jbo: ra mrobi'o ca lo prulamdei

source: Was he in Hokkaido last year?
jbo: xu ca lo prulamna'a ku zvati la xokaidon.

source: He is taking a walk.
jbo: ra ca ca'o cadzu

source: He went to Nagoya on business.
jbo: ko'a klama la .nagoias. mu'i tu'a lo kagycu'u

source: He has finished his work, hasn't he?
jbo: xu ko'a sisti lo vo'a gunka

source: He is afraid of death.
jbo: ra terpa lo nunmro

source: He twisted my arm.
jbo: ra selto'i lo mi birka

source: He didn't give me anything to eat.
jbo: ra na dunda da poi se cidja ku'o mi

source: He asked me if I liked mathematics.
jbo: pu reisku fi mi fe lo nu xukau mi nelci lo cmaci

source: He seems to be aware of my feelings.
jbo: ra simlu sanji lo se cinmo be mi

source: He doesn't speak our language.
jbo: ra na se bangu lo bangu be mi'a

source: He is my boss.
jbo: jatna mi

source: He is as tall as my father.
jbo: ko'a dunli lo patfu be mi lo rajycla

source: He is my friend.
jbo: ra pendo mi

source: He robbed me of every penny I had.
jbo: ro fepni poi mi pu ponse zo'u ra zerle'a fi mi

source: He is a better swimmer than I.
jbo: ko'a certu zmadu mi lo nu limne

source: He calls me Pete.
jbo: ra te cmene mi la.pit.

source: He has made me what I am today.
jbo: ko'a galfi mi lo cabna me mi

source: He thought he would kill himself.
jbo: ko'a pu smadi lo du'u ko'a ba sezycatra

source: He saw himself as the savior of the world.
jbo: ra jinvi lo du'u vo'a nurgau lo munje

source: He married a girl of his own choice.
jbo: ra speni lo nixli poi vo'a cuxna

source: He was proud of his daughter.
jbo: ko'a jgira tu'a lo tixnu

source: He cannot write his own name.
jbo: ko'a na kakne lo nu ciska lo ko'a cmene

source: He does speak well.
jbo: je'a ko'a xamgu tavla

source: He looks young.
jbo: ra simlu lo ka citno

source: He will have written a letter.
jbo: mi pu ciska lo xatra

source: He was seriously ill, and the doctor was sent for.
jbo: ko'a tcebilma .i cpedu fi lo mikce

source: He stayed at his aunt's house.
jbo: ra pu stali lo zdani be lo ra fetfamti

source: He is in his library.
jbo: zvati lo vo'a ckusro

source: It looks like he will win.
jbo: si'au ko'a ba jinga

source: He was embarrassed.
jbo: ko'a pu burna

source: He had decided on a new policy.
jbo: ko'a jdice fi lo cnino plajva

source: He told the truth.
jbo: ra mo'u cusku le jetnu

source: He seems kind.
jbo: ra simlu lo ka xendo

source: Living as he did in remote countryside, he seldom came up to town.
jbo: ko'a xabju lo nurma .isemu'ibo ko'a so'uroi klama le va tcadu

source: I think that he will succeed.
jbo: pe'i ta ba snada

source: He knows nothing about politics.
jbo: ko'a djuno noda lo su'u jecra'a

source: Is he right?
jbo: drani xu

source: He seems honest.
jbo: ra simlu lo ka stace

source: He proved to be honest.
jbo: ta pu jarco lo du'u vo'a stace

source: They say that he has a lot of old money.
jbo: ti'e ra ralte so'i lo dzena jdini

source: He picked up a red stone.
jbo: ra lafti lo xunre rokci

source: Is he a teacher?
jbo: xu ra ctuca

source: He drowned in the river.
jbo: ra jaurvasmro le rirxe

source: He does not get up early.
jbo: lo nu ra co'a cikna na clira

source: He left early; otherwise he could not have caught the train.
jbo: ko'a clira cliva .i no mu'ei lo natfe ko'a se marce lo trene

source: He advised an early start.
jbo: ra stidi lo nu clira cfari

source: He came running.
jbo: ra klama ca lo nu bajra

source: He does run.
jbo: ko'a bajra

source: He will probably fail.
jbo: .i lo nu fliba cu lakne

source: He was busy, and yet he came to help us.
jbo: ko'a pu tolcando .i ku'i ko'a pu sidju mi'a

source: He said that the earth goes round the sun.
jbo: ko'a xusra lo du'u la terdi cu carna la solri

source: He had come back from China.
jbo: ra pu ba'o klama fi lo jungu'e

source: He set out at four in the morning.
jbo: ra cliva ti'u li vo

source: He can't stay long.
jbo: ko'a na kakne lo nu ze'u stali

source: I think he is angry.
jbo: .ia fengu

source: He likes to live in Tokyo.
jbo: ra nelci lo nu xabju la.tokion.

source: He is an intelligent boy.
jbo: mencre nanla

source: He has too many books.
jbo: ralte du'e cukta

source: He doesn't know a lot about Japan.
jbo: ra fi lo gugdejupu na djuno so'i da

source: He always wanted to study Japanese.
jbo: ra ro roi djica lo nu tadni lo ponbau

source: He paid no attention to what she said.
jbo: ra na jundi lo se cusku be ko'a

source: He knows her by sight.
jbo: ko'a selsau le jvinu be ko'e

source: He gave her a book.
jbo: ko'a dunda lo cukta ko'e

source: He is jealous of her talent.
jbo: ko'a jilra ko'e lo ka stati

source: He loves her. She loves him, too.
jbo: ko'a prami je se prami ko'e

source: He looks tired.
jbo: ko'a vismlu lo ka tatpi

source: He seems tired.
jbo: ra simlu lo ka tatpi

source: He stood tall even under criticism.
jbo: ko'a jgira mu'inai tu'a lo se jusysku

source: He hates air travel.
jbo: ra xebni lo nu se vinji

source: He seems ill.
jbo: ra simlu lo ka bilma

source: He is a good writer.
jbo: ko'a xamgu ci'arfi'i

source: He looked calm, but actually he was very nervous.
jbo: ko'a panpi simlu gi'e ku'i xanka mutce

source: He walks to school.
jbo: ta cadzu klama lo ckule

source: He was busy.
jbo: ra pu tolcando

source: He's too busy.
jbo: ra dukse tolcando

source: He has been in Hokkaido before.
jbo: ra su'o re'u zvati la.xokaidon.

source: He has gone to Hokkaido.
jbo: ra pu klama la.xokaidon.

source: He never takes into account the fact that I am very busy.
jbo: ko'a no roi pensi lo du'u mi tolcando mutce

source: He objected to our plan.
jbo: ko'a pante lo ma'a se platu

source: He likes to read books.
jbo: ra nelci lo nu tcidu fi lo cukta

source: He is basically a nice man.
jbo: sa'u ko'a vrude

source: He washes the bike every week.
jbo: ra lumci lo relxilma ca lo ro jetfu

source: He makes it a rule to get up at six every morning.
jbo: ko'a zbasu lo javni be lo nu ko'a cikybi'o ti'u li xa ca ro cerni

source: He walks his dog every morning.
jbo: ra kanydzu lo vo'a gerku ca lo ro cerni

source: He drinks a glass of water every morning.
jbo: ra pinxe lo djacu lo pa kabri ca lo ro cerni

source: He doesn't come here every day.
jbo: ra na klama le zdani ca ro djedi

source: He gave his daughter quite a lot of money.
jbo: ko'a mo'u dunda lo mutce jdini lo tixnu be ko'a

source: He introduced his daughter to me.
jbo: ko'a pengau le ko'a tixnu mi

source: He will play soccer tomorrow.
jbo: ko'a ba kelci lo fudbolo ca lo bavlamdei

source: He will have to help his mother in the kitchen tomorrow.
jbo: ei ko'a ca lo bavlamdei cu sidju lo mamta be ko'a bu'u lo jupku'a

source: He closed his eyes.
jbo: ra ga'orgau loi kanla

source: He looked up at the night sky.
jbo: ra pu co'i catlu lo nicte tsani

source: He will come.
jbo: ko'a ba klama

source: He is a dependable boss.
jbo: ko'a se lacri jatna

source: He received rough treatment.
jbo: pu frigau ko'a lo ka vlile

source: He has the advantage of a good education.
jbo: ko'a ckaji loka prali kei ki'u lo vo'a za'i cilre

source: He's away on a trip.
jbo: ko'a roroi litru

source: He tends to be arrogant.
jbo: ta'e tolcumla

source: They welcomed me warmly, so I felt at home.
jbo: ra xendo rinsa mi .i se mu'i bo mi kufra

source: They have two sons and one daughter.
jbo: ra se bersa re da gi'e se tixnu pa da

source: They are singers.
jbo: ra sa'acre

source: They don't always obey their parents.
jbo: ko'a na'e roroi tinbe fi lo rirni be ko'a

source: They were afraid of the big dog.
jbo: terpa le barda gerku

source: They began to manufacture the machine on a large scale.
jbo: ko'a puco'a bralaizba le minji

source: Both of them are very cute.
jbo: lo re ko'a mutce melbi

source: They carried water in buckets.
jbo: bevri lo baktu be lo djacu

source: They all have come.
jbo: ro da ba'o klama

source: They are talking about music.
jbo: ra tavla fi lo zgike

source: They were not listening to music.
jbo: ra na pu ca'o tinju'i lo zgike

source: They spent the night on the beach.
jbo: ra zvati lo xaskoi ca lo nicte

source: They stood on the top of the hill.
jbo: ra pu sanli cmama'a

source: They are out of work now.
jbo: ko'a ca na seljibri

source: They are running now.
jbo: ko'a ca bajra

source: They won't allow us to enter the garden.
jbo: za'u ra na ba curmi lo nu mi'a nerkla le purdi

source: They fished the stream for trout.
jbo: ra fipkalte lo finprtruto bu'u lo cmari'e

source: They howled with laughter.
jbo: ra puca'o kixmi'a

source: Are they Japanese or Chinese?
jbo: ta ponjo gi'i jungo

source: They said that his claim was false.
jbo: ko'a cusku lo sedu'u lo se xusra be ko'e cu jitfa

source: They each paid separately.
jbo: lu'a ko'a pleji

source: They were busy.
jbo: tolcando

source: They didn't keep their promise.
jbo: za'u ra pu tinbe nai lo be lo nei se nupre

source: They were not sure whether they could come or not.
jbo: lo za'u ra pu nalbirti lo nu xukau lo no'a cu ka'e klama

source: Nobody knows what it is that has been bothering him so much.
jbo: no da djuno fi lo nu ma kau se patpei be ko'a mutce

source: I don't see him.
jbo: mi ra na viska

source: Every time I looked at him, he was yawning.
jbo: ra ca ro nu mi catlu kei moltenva'u

source: Don't trust him.
jbo: ko na lacri ra

source: Do you know where she lives?
jbo: xu do djuno fi lo se xabju be ra

source: Do you know what she said?
jbo: xu do djuno lo se cusku be ra

source: I heard her singing.
jbo: mi pu tirna lo nu ko'a ca'o sanga

source: It is quite natural for her to get angry.
jbo: ko'a na'o co'a fengu

source: What she said turned out to be false.
jbo: fi lo ko'a se cusku pu co'i facki fe lodu'u jitfa

source: Her look says that she loves you.
jbo: .i lo nu zgana do cu selsmu lo du'u prami do

source: I wish she were alive now.
jbo: .i .a'o cy. ca'o jmive ca

source: She was heard to cry for help.
jbo: tirna lo nu ko'a krixa mu'i lo ka djudji

source: I'll let you know when she arrives.
jbo: mi ba jungau do ca lo nu ra tolcliva

source: She gave me a present.
jbo: ra dunda lo seldu'a mi

source: She has two brothers, who work in the computer industry.
jbo: re bruna be ko'a cu se jibri lo gundi be lo skami

source: She has a natural talent for music.
jbo: se zgike ke jinzi stati

source: She didn't want to get involved.
jbo: ko'a na pu djica lonu ce'u se cuntu

source: She doesn't have any enemies.
jbo: no da bradi ra

source: I wish I had seen her.
jbo: mi djica lo nu pu viska ra

source: Her father passed away last week.
jbo: lo patfu be ra cu mrobi'o ca lo pu zi jetfu

source: With all her faults, I like her.
jbo: .i va'o ji'a tu'a ro lo xy. cfila mi xy. nelci

source: Her lecture is above my head.
jbo: mi na jimpe le ctununta'a be ko'a

source: One of her hobbies is collecting T-shirts.
jbo: ko'a selci'i lo nu do jajgau lei creka

source: Her new hat becomes her.
jbo: lo ra cnino mapku cu mapti ra

source: Both of her sons died during the war.
jbo: lo ko'a re bersa cu mrobi'o ca'o le nunjamna

source: I apologized to her for stepping on her foot.
jbo: mi ko'a xersku mu'i lo nu stapa lo ri jamfu

source: Her father is Japanese.
jbo: lo patfu be ra cu ponjo

source: Her mother is writing a letter.
jbo: lo mamta be ra ca'o ciska lo xatra

source: I am convinced of her innocence.
jbo: mi birti lo du'u ko'a zernalfu'e

source: She said she was walking through the woods, looking for wild flowers.
jbo: ra cusku lo se du'u cadzu pa'o lo ricfoi ca lo nu facki fi lo cilce xrula

source: She plays the piano very well.
jbo: ra certu lo nu zgiterca'a lo pipno

source: She is a most beautiful lady.
jbo: ta melbi traji ke nobli ninmu

source: She bought two dozen eggs.
jbo: ko'a pu terve'u re loi gai sovda

source: Does she know your phone number?
jbo: xu ra djuno fi lo fonjudri be do

source: She does not have many friends in Kyoto.
jbo: so'u xabju be la.kioton. cu pendo ra

source: She is always cold-hearted.
jbo: ko'a roroi se ke lenku risna pe'a

source: When will she return home?
jbo: ba ca ma ra xrukla lo zdani

source: She married a rich man.
jbo: ko'a speni lo ricfu nanmu

source: She is bound to pass the examination.
jbo: ju'o ko'a snada tu'a le cipra

source: She is not only beautiful but also intelligent.
jbo: ko'a melbi gi'e mencre

source: She said goodbye.
jbo: ra cusku lu co'o li'u

source: She knows that John loved her.
jbo: .i djuno lo du'u la .djan. pu prami vo'a

source: She said she must leave at once.
jbo: ko'a pu cusku lo se du'u ko'a ca .ei cliva

source: She is a wonderful woman.
jbo: ko'a selmanci ninmu

source: She described the scene in detail.
jbo: .i skicu lo jvinu fo lo ka makau tcila ce'u

source: She telephoned just now.
jbo: ra fonta'a puzi

source: She spread a cloth over the table.
jbo: ko'a pejgau lo bukpu lo jubme

source: She would not disclose the secret.
jbo: .i mipri

source: I wonder where she has gone.
jbo: mi kucli lo du'u ra ma kau mo'u klama

source: She is very pretty.
jbo: ra mutce melbi

source: She is very intelligent.
jbo: ra mutce mencre

source: She cooks very well.
jbo: mutce xamgu jukpa

source: She is crying.
jbo: ra ca klaku

source: She is far from a fool.
jbo: ko'a na sai bebna

source: She kept on dancing all through the party.
jbo: ko'a co'u nai dansu ze'a pi ro lo nunsla

source: She fell head over heels from the ladder.
jbo: ko'a pu sutra farlu fi le serti

source: She left for Paris.
jbo: ta pu klama la .paris.

source: Does she play the piano?
jbo: xu ra se zgica'a lo pipno

source: She has the ability to speak and write French.
jbo: ko'a kakne lo ka cusku je ciska bau la fasybau

source: Does she speak French?
jbo: xu ra se bangu lo fraso

source: She is not here yet.
jbo: ra pu'o klama ti

source: She is a pretty girl to look at.
jbo: ra nixli co mebli fi lo ka viska

source: She'll try it once more.
jbo: ra ba troci za'u re'u

source: She cut the apple in half.
jbo: ra ka'argau lo plise re da

source: She paid a visit to Laurie's house.
jbo: ra pu vitke lo zdani be la .loris.

source: She had a bad tooth taken out.
jbo: .i minde fi lo ka lebna tu'a lo xlali denci vo'a

source: She is very afraid of the dark.
jbo: mutce terpa tu'a lo manku

source: She made the same mistake as before.
jbo: ra srera lo mintu be lo purci

source: She died of stomach cancer.
jbo: ra pu mrobi'o lo djaruntyrango kenra

source: Isn't she a doctor?
jbo: xu ra na mikce

source: She speaks German and French, not to mention English.
jbo: ko'a ka'e baupli lo dotco .e lo fraso .e ji'a lo glico

source: She likes to listen to music.
jbo: ra nelci lo nu tinju'i lo zgike

source: She went to Paris to study music.
jbo: ko'a pu klama la paris. mu'i lo ka tadni tu'a lo zgike

source: How many pens does she have?
jbo: ra ralte xo lo penbi

source: She began to sing.
jbo: ra co'a sanga

source: She became a singer.
jbo: ko'a pu co'a sanga prenu

source: She says that she likes flowers.
jbo: ko'a cusku lo nu ko'a nelci lo xrula

source: She is married to a foreigner.
jbo: speni lo se ke drata gugde

source: She is a fluent speaker of English.
jbo: ra filta'a fo lo glico

source: She dialed the wrong number.
jbo: lo fetsi pu judrypli lo frica

source: She cried.
jbo: ko'a pu klaku

source: She graduated from high school last year.
jbo: ko'a kulmu'o ca lo prulamna'a

source: She left here long before you arrived.
jbo: ra cliva ti pu zu lo nu do klama

source: Did she show you the picture?
jbo: xu ra jarco lo pixra do

source: She isn't married.
jbo: na speni

source: Her marriage brought happiness to her parents.
jbo: lo ko'a nunspe loi ko'a rirni cu se gleki

source: She can drive a car.
jbo: ko'a kakne loka sazri lo karce

source: She is writing a letter now.
jbo: ko'a ca ciska lo xatra

source: She left for London yesterday.
jbo: ra cliva ca lo prulamdei se ka'a la.lyndyn.

source: She tried to kill herself last night.
jbo: ko'a troci lonu vo'a vo'a catra kei ti'u prula'i nicte

source: She is busy with her work.
jbo: lo fetsi cu zukcfu lo jibri

source: She made the children clean up their own rooms.
jbo: ra gasnu lo nu lo'i verba cu jisygau lo'i ri kumfa

source: She cried for hours without ceasing.
jbo: .i lonu ru'i klaku ku cacra li so'i

source: She cheered me up when I was feeling blue.
jbo: ra gekygau mi ca lo nu badri

source: She explained the matter to me.
jbo: ko'a pu ciksi tu'a le tcini mi

source: She cooked some fish for me.
jbo: ra jukpa lo finpe mu'i tu'a mi

source: She gave me a wonderful present.
jbo: ra dunda lo banli seldu'a mi

source: She ignored all my warnings.
jbo: ko'a pu tolju'i lo mi ro jdenoi

source: She took her own life.
jbo: ko'a sisti lo nu ko'a selnunji'e

source: She is proud of her daughter.
jbo: ko'a jgira tu'a le tixnu be ko'a

source: She can ask and answer questions.
jbo: ko'a ka'e te frati je frati

source: She isn't afraid of snakes.
jbo: ra na terpa lo since

source: She has something in her hand.
jbo: ra jgari da lo xance

source: She has done her homework.
jbo: ko'a mulgau le ri barkulselgu'a

source: She has a small black dog.
jbo: ra ralte lo cmalu xekri gerku

source: She stayed there for a moment.
jbo: ko'a puze'i stali

source: She wants a new dress badly.
jbo: ko'a mutce djica tu'a lo cnino taxfu

source: She likes blue dresses.
jbo: ra nelci lo blanu pastu

source: She decided on a blue dress.
jbo: ra jdice tu'a lo blanu pastu

source: She seemed to be idle.
jbo: ko'a simlu lo ka cando

source: She is a short story writer.
jbo: ko'a tordu lisri ckufi'i

source: She observed how butterflies fly.
jbo: ko'a zgana lo tadji be lo nu lo toldi cu vofli

source: She called me up from Tokyo.
jbo: ra fonta'a mi ra'i la.tokion.

source: She got a present from her boyfriend.
jbo: ko'a te dunda le ko'a pampe'o

source: She gave him a watch.
jbo: ra dunda lo junla ra

source: She is annoyed at his ignorance.
jbo: raxipa se fanza lo nu raxire nalju'o

source: She has some beautiful antique furniture.
jbo: ko'a ponse so'o melbi ke laldo nilce

source: She's a beauty from a distance.
jbo: ra melbi ve ga'a lo nu darno

source: She is not afraid of anything.
jbo: ra terpa no da

source: She burst into the room.
jbo: ko'a bajykla lo kumfa

source: She showed me her room.
jbo: ra jarco tu'a lo ri kumfa mi

source: She sleeps with two pillows.
jbo: ko'a sipna je pilno be re kicne

source: She is knitting a sweater.
jbo: ra nivji lo nivycreka

source: She may have to quit her job next month.
jbo: .i ju'ocu'i .eidai jai gau seljibyfa'o ca lo bavla'ima'i

source: She shed tears.
jbo: ra klaku

source: She grew roses.
jbo: .i purdi fi lo rozgu

source: I'm sad.
jbo: mi badri

source: I saw a plane.
jbo: mi pu viska lo vinji

source: The plane was approaching London.
jbo: lo vinji pu ca'o zenba co jibni la landyn

source: The plane arrived on time.
jbo: lo vinji pu klama ti'u lo se platu

source: Lake Biwa came in sight.
jbo: la .bi,uas. poi lalxu cu co'a se viska

source: I don't need it.
jbo: mi na nitcu ko'a

source: Being ill, I stayed at home all day long.
jbo: mu'i lo nu bilma kei mi zvati lo zdani ca lo culno djedi

source: My father is a businessman.
jbo: lo patfu po mi cu'upre

source: My father fixed a broken chair.
jbo: lo patfu be mi cu cikre lo spofu stizu

source: My father is in good health.
jbo: lo patfu be mi ku kanro

source: My father complained about the traffic noise.
jbo: lo patfu be mi cu pante lo nu karce savru

source: Father is busy writing letters.
jbo: la .paf. cu tolcando lonu ciska lo xatra

source: My father lives and works in Tokyo.
jbo: lo patfu be mi cu xabju la.tokion. gi'e gunka bu'u ty

source: My father won't allow me to keep a dog.
jbo: lo mi patfu ku na curmi lo nu mi ralte lo gerku

source: My father has the same car as Mr Kimura's.
jbo: lo patfu be mi cu ralte lo karce ne lo klesi co du be lo la.kimuras. co'e

source: There are a lot of girls in the room.
jbo: so'i nixli cu nenri le kumfa

source: Is there anyone in the room?
jbo: xu da poi prenu cu nenri le kumfa

source: Clean up the room.
jbo: ko lumci lo kumfa

source: The wind is blowing east.
jbo: da brife lo se stuna

source: Buddhism was introduced into Japan in 538.
jbo: jarco lo budjo lo ponjo de'i li pi'e pi'e mucibi

source: I know.
jbo: mi djuno

source: Rice is grown in many parts of the world.
jbo: lo rismi cu te purdi fe'e so'i roi lo terdi

source: Study!
jbo: ko tadni

source: My mother cut the cake.
jbo: lo mi mamta pu katna lo titnanba

source: My mother is writing a letter now.
jbo: lo be mi mamta caca'o ciska lo xatra

source: My mother can't ride a bicycle.
jbo: lo mamta be mi na kakne lo nu pilno lo relxilma'e

source: She inherited her mother's blue eyes.
jbo: ra cerda lo ka blanu kanla kei lo mamta

source: The mother greatly missed her daughter, who was away at college.
jbo: lo mamta cu mutce caucni lo ri tixnu noi zvati lo ma'urcu'e

source: The hat got wet and went limp.
jbo: le sedyta'u cu cimce'oranbi'o

source: Remove your hat.
jbo: ko vimcu lo do sedyta'u

source: It is not always cold in Hokkaido.
jbo: na ro roi lenku bu'u la.xokaidon.
